/*Задача
1. Объявите две переменные: admin и name.
2. Запишите строку "Джон" в переменную name.
3. Скопируйте значение из переменной name в admin.
4. Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
*/
/*let name = "Джон";
let admin = name;
alert (admin);*/

/*Задача
Создайте переменную для названия нашей планеты. Как бы вы её назвали?
Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
/*
let planet;
let visitor;
 */


 /*Задача
Какие буквы (заглавные или строчные) использовать для имён констант?
Рассмотрим следующий код:
const birthday = '18.04.1982';
const age = someCode(birthday);
У нас есть константа birthday, а также age, которая вычисляется при помощи некоторого кода, используя значение из birthday (в данном случае детали не имеют значения, поэтому код не рассматривается).
Можно ли использовать заглавные буквы для имени birthday? А для age? Или одновременно для обеих переменных?
const BIRTHDAY = '18.04.1982'; // тут можно использовать Заглавные
const AGE = someCode(BIRTHDAY); // тут нет*/


/*Задача
Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.*/
/*let a=10;
if (a==10){
    alert (true);
}
else{
    alert (false);
}*/


/*Задача
Создайте переменную num и присвойте ей значение 3. Выведите значение этой переменной на экран с помощью метода alert.*/

/*let num=3;
alert (num);*/


/*Задача
Создайте переменные a=10 и b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).*/

/*let a=10;
let b=2;
console.log (a+b,a-b,a*b,a/b);*/


/*Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.*/

/*let c=15;
let d=2;
let result=c+d;
alert (result);*/


/*Задача
Создайте переменные a=10, b=2 и c=5. Выведите на экран их сумму.*/

/*let a=10;
let b=2;
let c=5;
alert (a+b+c);*/

/*Задача
Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. 
Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. 
Выведите на экран значение переменной result.*/

let a=17;
let b=10;
let c=a-b;
let d=7;
let result=c+d;
alert (result);



